{
	"error_login": "An error occurred while trying to log you in.",
	"error_registration": "An error occurred when we tried to register you.",
	"error_resetPassword": "An error occurred when we tried to reset your password.",
	"error_updateUser": "An error occurred when we tried to update the information about you as a user.",
	"error_changePassword": "An error occurred while changing your password.",
	"error_fetchProfile": "An error occurred while getting your profile data.",
	"error_fetchActivePlan": "An error occurred while getting the informatino about your current plan.",
	"error_createSubscription": "An error occurred when we tried to create your subscription.",
	"error_fetchTeam": "An error occurred when we tried to get the information about the team.",
	"error_fetchContestRef": "An error occurred when we tried to get the inforamtion about the contest.",
	"error_fetchContestRequest": "An error occurred when we tried to get the pending request to join this contest.",
	"error_fetchContestStatementSummaryRef": "An error occurred when we tried to get the final results",
	"error_updatingContestRole": "An error occurred when we tried to change the role of the user.",
	"error_updatingContestStatement": "Error occured during updating contest statement.",
	"error_fetchEvent": "An error occurred when we tried to get the details of this event.",
	"error_featuredEvent": "An error occurred when we tried to get the events featured to you.",
	"error_fetchEvents": "An error occurred when we tried to get the details of your events.",
	"error_addEvent": "An error occurred while we tried to add the event.",
	"error_addEventImage": "An error occurred when we tried to add the event image.",
	"error_attendEvent": "An error occurred when we tried to let you attend the event.",
	"error_myTeam": "An error occurred when we tried to get the details about the team.",
	"error_invitingTeam": "An error occurred when we tried to invite the user to the team.",
	"error_addTeamImage": "An error occurred while adding the team image.",
	"error_updateTeam": "An error occurred while updating the team.",
	"error_selectTeam": "An error occurred when we tried to get the information about the current team.",
	"error_joinTeam": "An error occurred when we tried to let you join the team.",
	"error_joinRequestTeam": "An error occurred when we tried to find out who requested to join the team.",
	"error_acceptRequest": "An error occurred while accepting the request.",
	"error_declineRequest": "An error occurred while declining the request.",
	"error_searchTeam": "An error occurred while searching the team.",
	"error_addTasting": "An error occurred while adding tasting.",
	"error_deleteTasting": "An error occurred while deleting the tasting.",
	"error_fetchNav": "An error occurred when we tried to get the menu information.",
	"error_searchContest": "An error occurred when we tried get the information about the contest.",
	"error_rejectContest": "An error occurred while rejecting the request.",
	"error_addUserContest": "An error occurred while accepting the user."
}
